import { FC } from 'react';

import PageLayout from '@/components/common/layout/page-layout/PageLayout';
import PollPage from '@/components/pages/poll-page';

const Poll: FC = () => {
  return (
    <PageLayout
      title="Опитування"
      description="На сторінці опитування ви зможете пройти опитування для викладача. Ця сторінка створена для збору ваших відгуків та оцінок щодо викладача, його методики викладання та загального враження від занять. Для початку опитування потрібно авторизуватися. Якщо ви ще не маєте облікового запису, ви зможете створити його швидко та без зайвих зусиль.Після авторизації ви зможете вибрати конкретного викладача, для якого бажаєте пройти опитування. За допомогою форми опитування ви зможете виразити свою думку стосовно різних аспектів роботи викладача, таких як професійні навички, комунікація зі студентами, зрозумілість пояснень, організація занять та багато іншого. Всі ваші відповіді та відгуки будуть оброблені конфіденційно та використовуватимуться для покращення якості навчання та розвитку. Якщо сталася помилка під час завантаження або опитування, ви отримаєте повідомлення про помилку, що дозволить вам швидко реагувати та знайти відповідне рішення. Запрошуємо вас пройти це опитування та долучитися до поліпшення навчального процесу! Ваша думка має велике значення для нас."
    >
      <PollPage />
    </PageLayout>
  );
};

export default Poll;
