import React from 'react';
import { Box, Typography } from '@mui/material';

import * as styles from './AboutPage.styles';

const AboutPage = () => {
  return (
    <Box sx={styles.container}>
      <Box sx={styles.content}>
        <Box sx={{ display: 'flex', flexDirection: 'column' }}>
          <Typography variant="h6Bold" sx={{ marginBottom: '1%' }}>
            Висновок
          </Typography>
          <Typography>
            Факультет інформатики та обчислювальної техніки — це не просто
            красивий корпус, а простір, де кожен може отримати знання та знайти
            себе.
          </Typography>
        </Box>
        <Box sx={{ display: 'flex', flexDirection: 'column' }}>
          <Typography variant="h6Bold" sx={{ marginBottom: '1%' }}>
            Висновок
          </Typography>
          <Typography>
            Факультет інформатики та обчислювальної техніки — це не просто
            красивий корпус, а простір, де кожен може отримати знання та знайти
            себе.
          </Typography>
        </Box>
        <Box sx={{ display: 'flex', flexDirection: 'column' }}>
          <Typography variant="h6Bold" sx={{ marginBottom: '1%' }}>
            Висновок
          </Typography>
          <Typography>
            Факультет інформатики та обчислювальної техніки — це не просто
            красивий корпус, а простір, де кожен може отримати знання та знайти
            себе.
          </Typography>
        </Box>
        <Box sx={{ display: 'flex', flexDirection: 'column' }}>
          <Typography variant="h6Bold" sx={{ marginBottom: '1%' }}>
            Висновок
          </Typography>
          <Typography>
            Факультет інформатики та обчислювальної техніки — це не просто
            красивий корпус, а простір, де кожен може отримати знання та знайти
            себе.
          </Typography>
        </Box>
        <Box sx={{ display: 'flex', flexDirection: 'column' }}>
          <Typography variant="h6Bold" sx={{ marginBottom: '1%' }}>
            Висновок
          </Typography>
          <Typography>
            Факультет інформатики та обчислювальної техніки — це не просто
            красивий корпус, а простір, де кожен може отримати знання та знайти
            себе.
          </Typography>
        </Box>
        <Typography variant="h3">Спеціальності факультету</Typography>
        <Box sx={{ display: 'flex', flexDirection: 'column' }}>
          <Typography>
            Факультет надає можливість обрати власну спеціалізацію та стати
            фахівцем у галузі ІТ-технологій. Наразі катедри пропонують освітні
            програми для трьох спеціальностей:
          </Typography>
          <Typography sx={{ marginBottom: '5%' }}>
            Спеціальність «121 Інженерія програмного забезпечення» готує
            програмістів у класичному розумінні. Протягом навчання можна
            поглиблено опанувати розробку програмного забезпечення для різних
            операційних систем, мережеву інженерію та роботу зі штучним
            інтелектом. Факультет пропонує гнучкий освітній план із новітніми
            теоретичними матеріалами та застосуванням сучасних концепцій у світі
            інформаційних технологій.
          </Typography>
          <Typography sx={{ marginBottom: '5%' }}>
            Спеціальність «123 Комп`ютерна інженерія» зосереджена на
            низькорівневому програмуванні та фізичних аспектах комп`ютерів.
            Випускники мають глибокі знання в галузі проєктування процесорів,
            системного програмування та моделювання комп`ютерних мереж. Матеріал
            курсу опановується без проблем завдяки чітким та зрозумілим освітнім
            ресурсам, досвідченим викладачам та достатній кількості необхідного
            обладнання на факультеті.
          </Typography>
          <Typography sx={{ marginBottom: '2%' }}>
            Спеціальність «126 Інформаційні системи та технології» виникла в
            Україні саме за ініціативи ФІОТу в 2017 році. Студентам надають
            знання з усіх можливих галузей: бекенд, створення серверних
            застосунків, фізичні основи комп`ютерів та веброзробка. Також
            підготована велика кількість освітніх програм для різних напрямів,
            що ґрунтуються на сучасних технологіях та принципах програмування.
          </Typography>
        </Box>

        <Typography variant="h3">Студентська активність</Typography>
        <Box sx={{ display: 'flex', flexDirection: 'column' }}>
          <Typography variant="h6Bold" sx={{ marginBottom: '1%' }}>
            Студрада
          </Typography>
          <Typography>
            Студентська рада ФІОТу одна з найбільш активних в університеті. Її
            члени проводять різноманітні тематичні заходи як для студентів, так
            і для вступників, ведуть новинні канали, а також розробляють власний
            вебсайт. За певний напрям роботи відповідає окремий відділ. Кожен
            студент може долучитися до роботи та допомогти в розвитку
            факультету.
          </Typography>
        </Box>

        <Box sx={{ display: 'flex', flexDirection: 'column' }}>
          <Typography variant="h6Bold" sx={{ marginBottom: '1%' }}>
            Заходи
          </Typography>
          <Typography>
            Щорічно Студрада організовує День факультету, Абітфест, гітарні та
            літературні вечори, а також освітні лекції від спонсорів. Музичні
            заходи проводяться у клубі «Барви». Зробивши благодійний внесок для
            ЗСУ, студенти мають змогу послухати авторські пісні андеграунд
            гуртів. Для освітніх ініціатив існує Хаб ФІОТ — унікальний проєкт
            співпраці з провідними ІТ-компаніями, де проводять безплатні лекції,
            літні школи та навчальні курс
          </Typography>
        </Box>
        <Box sx={{ display: 'flex', flexDirection: 'column' }}>
          <Typography variant="h6Bold" sx={{ marginBottom: '1%' }}>
            Благодійність
          </Typography>
          <Typography>
            З початку повномасштабного вторгнення студентство факультету
            регулярно проводить збори на зброю та обладнання для наших
            захисників. Завдяки небайдужим, на фронт відправилися нові
            автомобілі, термінали зв’язку, прилади нічного бачення, аптечки,
            бронежилети та інші речі, які необхідні нашим студентам та
            випускникам на фронті.
          </Typography>
        </Box>
        <Box sx={{ display: 'flex', flexDirection: 'column' }}>
          <Typography variant="h6Bold" sx={{ marginBottom: '1%' }}>
            Висновок
          </Typography>
          <Typography>
            Факультет інформатики та обчислювальної техніки — це не просто
            красивий корпус, а простір, де кожен може отримати знання та знайти
            себе.
          </Typography>
        </Box>
      </Box>
    </Box>
  );
};

export default AboutPage;
